---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetSet
source: html/b76daaec-4e96-af6c-336f-7ad9eba6ac82.htm
---
# Autodesk.Revit.DB.Visual.AssetSet

## Syntax (C#)
```csharp
public class AssetSet : APIObject, IEnumerable
```